js216/stm32mp135_test_board/baremetal/qspi/src/qspi.c
// SPDX-License-Identifier: BSD-3-Clause

/**
 * @file qspi.c
 * @brief QUADSPI bare-register driver for FPGA bring-up.  Indirect read /
 *        write, memory-mapped read, and auto-poll status modes.  Polled
 *        only; HAL is used for GPIO pin-mux and clock enables.
 * @author Jakob Kastelic
 * @copyright 2026 Jakob Kastelic
 */

#include "qspi.h"
#include "board.h"
#include "core_ca.h"
#include "printf.h"
#include "stm32mp135fxx_ca7.h"
#include "stm32mp13xx_hal.h"
#include "stm32mp13xx_hal_def.h"
#include "stm32mp13xx_hal_gpio.h"
#include "stm32mp13xx_hal_rcc.h"
#include <stddef.h>
#include <stdint.h>

#define CCR_INSTRUCTION_Pos 0U
#define CCR_IMODE_Pos       8U
#define CCR_ADMODE_Pos      10U
#define CCR_ADSIZE_Pos      12U
#define CCR_ABMODE_Pos      14U
#define CCR_ABSIZE_Pos      16U
#define CCR_DCYC_Pos        18U
#define CCR_DMODE_Pos       24U
#define CCR_FMODE_Pos       26U

#ifndef QSPI_FTHRES
#define QSPI_FTHRES 15U
#endif

static int initialised;
static uint32_t cur_prescaler;
static uint32_t cur_fsize;
static uint32_t cur_csht;
static uint32_t cur_fthres = QSPI_FTHRES;
static uint32_t cur_dlyb_sel;
static uint32_t cur_dlyb_unit;
static uint32_t mdma_active_dst;
static uint32_t mdma_active_len;
static bool mdma_active;
static bool qspi_io_comp_tried;

uint32_t qspi_get_prescaler(void) { return cur_prescaler; }
uint32_t qspi_get_fsize(void)     { return cur_fsize; }
uint32_t qspi_get_csht(void)      { return cur_csht; }
uint32_t qspi_get_fthres(void)    { return cur_fthres; }

HAL_StatusTypeDef qspi_set_dlyb(uint32_t sel, uint32_t unit);
HAL_StatusTypeDef qspi_set_fthres(uint32_t fthres);

static void qspi_apply_fthres(uint32_t fthres)
{
   uint32_t cr = QUADSPI->CR;
   cr &= ~QUADSPI_CR_FTHRES_Msk;
   cr |= (fthres << QUADSPI_CR_FTHRES_Pos);
   QUADSPI->CR = cr;
}

HAL_StatusTypeDef qspi_set_dlyb(uint32_t sel, uint32_t unit)
{
   if (sel > 15U || unit > 127U)
      return HAL_ERROR;
   cur_dlyb_sel  = sel;
   cur_dlyb_unit = sel ? unit : 0U;
   return HAL_OK;
}

HAL_StatusTypeDef qspi_set_fthres(uint32_t fthres)
{
   if (fthres > 15U)
      return HAL_ERROR;
   if (initialised && qspi_busy())
      return HAL_BUSY;

   cur_fthres = fthres;
   if (initialised)
      qspi_apply_fthres(cur_fthres);
   return HAL_OK;
}

static uint32_t lines_to_mode(qspi_lines_t l)
{
   switch (l) {
      case QSPI_LINES_1: return 1U;
      case QSPI_LINES_2: return 2U;
      case QSPI_LINES_4: return 3U;
      default: return 0U;
   }
}

static bool raw_quad_uses_frame(bool raw, qspi_lines_t data_lines)
{
   return raw && data_lines == QSPI_LINES_4;
}

static void qspi_log_raw_regs(const char *tag, uint32_t len, bool raw,
                              qspi_lines_t data_lines, bool framed_raw)
{
   if (!raw || len > 4096U)
      return;

   const uint32_t ccr = QUADSPI->CCR;
   const uint32_t cr  = QUADSPI->CR;
   my_printf("qspi_rawcfg %s len=%lu lines=%lu frame=%s "
             "cr=%08lx dcr=%08lx sr=%08lx ccr=%08lx ar=%08lx "
             "abr=%08lx dlr=%08lx imode=%lu admode=%lu adsize=%lu "
             "abmode=%lu absize=%lu dcyc=%lu dmode=%lu fmode=%lu "
             "sioo=%lu ddr=%lu fthres=%lu flevel=%lu tcr=NA\r\n",
             tag,
             (unsigned long)len,
             (unsigned long)data_lines,
             framed_raw ? "6b" : "data",
             (unsigned long)cr,
             (unsigned long)QUADSPI->DCR,
             (unsigned long)QUADSPI->SR,
             (unsigned long)ccr,
             (unsigned long)QUADSPI->AR,
             (unsigned long)QUADSPI->ABR,
             (unsigned long)QUADSPI->DLR,
             (unsigned long)((ccr >> CCR_IMODE_Pos) & 0x3U),
             (unsigned long)((ccr >> CCR_ADMODE_Pos) & 0x3U),
             (unsigned long)((ccr >> CCR_ADSIZE_Pos) & 0x3U),
             (unsigned long)((ccr >> CCR_ABMODE_Pos) & 0x3U),
             (unsigned long)((ccr >> CCR_ABSIZE_Pos) & 0x3U),
             (unsigned long)((ccr >> CCR_DCYC_Pos) & 0x1FU),
             (unsigned long)((ccr >> CCR_DMODE_Pos) & 0x3U),
             (unsigned long)((ccr >> CCR_FMODE_Pos) & 0x3U),
             (unsigned long)((ccr >> QUADSPI_CCR_SIOO_Pos) & 0x1U),
             (unsigned long)((ccr >> QUADSPI_CCR_DDRM_Pos) & 0x1U),
             (unsigned long)((cr >> QUADSPI_CR_FTHRES_Pos) & 0x0FU),
             (unsigned long)((QUADSPI->SR & QUADSPI_SR_FLEVEL_Msk) >>
                             QUADSPI_SR_FLEVEL_Pos));
}

static void bench_consume_byte(uint8_t b, uint32_t i,
                               uint32_t *crc_io,
                               uint32_t *first_err_io, uint8_t got16[16])
{
   uint32_t crc = *crc_io;
   const uint8_t exp = (uint8_t)(i & 0xFFU);

   if (i < 16U)
      got16[i] = b;
   crc ^= (uint32_t)b;
   for (int j = 0; j < 8; j++)
      crc = (crc >> 1) ^ (0xEDB88320UL & (-(int32_t)(crc & 1U)));
   if (b != exp && *first_err_io == 0xFFFFFFFFUL)
      *first_err_io = i;
   *crc_io = crc;
}

static void setupgpio_ex(GPIO_TypeDef *port, uint32_t pin, uint32_t af,
                         uint32_t speed, uint32_t pull)
{
   GPIO_InitTypeDef g = {
       .Pin       = pin,
       .Mode      = GPIO_MODE_AF_PP,
       .Pull      = pull,
       .Speed     = speed,
       .Alternate = af,
   };
   HAL_GPIO_Init(port, &g);
}

static void setupgpio(GPIO_TypeDef *port, uint32_t pin, uint32_t af)
{
   setupgpio_ex(port, pin, af, GPIO_SPEED_FREQ_VERY_HIGH, GPIO_NOPULL);
}

static void setupgpio_data(GPIO_TypeDef *port, uint32_t pin, uint32_t af)
{
   setupgpio_ex(port, pin, af, GPIO_SPEED_FREQ_VERY_HIGH, GPIO_NOPULL);
}

static void qspi_raw_frame_reset_gap(bool raw)
{
   if (!raw)
      return;

   qspi_abort();
   HAL_Delay(1U);
}

static void setup_qspi_io_timing(void)
{
   if (qspi_io_comp_tried)
      return;

   qspi_io_comp_tried = true;
   __HAL_RCC_SYSCFG_CLK_ENABLE();
   (void)HAL_SYSCFG_EnableIOCompensation(SYSCFG_MAIN_COMP_CELL);
}

static void release_board_qspi_conflicts(void)
{
   GPIO_InitTypeDef g = {
      .Pin   = CTP_RST_PIN,
      .Mode  = GPIO_MODE_OUTPUT_PP,
      .Pull  = GPIO_NOPULL,
      .Speed = GPIO_SPEED_FREQ_LOW,
   };

   /* EVB QSPI_NCS/IO2 share the touch-panel I2C5 SCL/SDA nets. Keep the
    * touch controller reset while QSPI owns those pads so PH6 is only
    * the raw-data input path during the high-speed quad phase. */
   HAL_GPIO_WritePin(CTP_RST_PORT, CTP_RST_PIN, GPIO_PIN_RESET);
   HAL_GPIO_Init(CTP_RST_PORT, &g);

   __HAL_RCC_I2C5_CLK_ENABLE();
   __HAL_RCC_I2C5_FORCE_RESET();
   __HAL_RCC_I2C5_RELEASE_RESET();
   __HAL_RCC_I2C5_CLK_DISABLE();
}

static void setup_dlyb(void)
{
   DLYB_QUADSPI->CR = 0U;
   if (cur_dlyb_sel == 0U) {
      DLYB_QUADSPI->CFGR = 0U;
      return;
   }

