js216/stm32mp135_test_board/baremetal/qspi/src/qspi.c
   DLYB_QUADSPI->CR = DLYB_CR_DEN | DLYB_CR_SEN;
   DLYB_QUADSPI->CFGR =
      ((cur_dlyb_sel & 0x0FU) << DLYB_CFGR_SEL_Pos) |
      ((cur_dlyb_unit & 0x7FU) << DLYB_CFGR_UNIT_Pos);
   DLYB_QUADSPI->CR = DLYB_CR_DEN;
}

int qspi_busy(void)
{
   return (QUADSPI->SR & QUADSPI_SR_BUSY) ? 1 : 0;
}

void qspi_abort(void)
{
   /* Force ABORT unconditionally even when BUSY=0.  After an indirect
    * read whose DLR is not a multiple of (FTHRES+1) the receive FIFO
    * can hold up to FTHRES leftover bytes that MDMA never pulled (FTF
    * never re-asserts below threshold).  BUSY clears with the transfer
    * but those stale bytes survive into the next transaction, so the
    * next read returns shifted data starting with the residual.  ABORT
    * resets the FIFO per RM, so always run it. */
   QUADSPI->CR |= QUADSPI_CR_ABORT;
   for (uint32_t i = 0; i < 100000U; i++) {
      if (!(QUADSPI->CR & QUADSPI_CR_ABORT))
         break;
   }
   for (uint32_t i = 0; i < 100000U; i++) {
      if (!(QUADSPI->SR & QUADSPI_SR_BUSY))
         break;
   }
   QUADSPI->FCR = QUADSPI_FCR_CTOF | QUADSPI_FCR_CSMF | QUADSPI_FCR_CTCF |
                  QUADSPI_FCR_CTEF;
   if (initialised)
      qspi_apply_fthres(cur_fthres);
}

HAL_StatusTypeDef qspi_init(uint32_t prescaler, uint32_t fsize_log2,
                            uint32_t cs_high_cyc, uint32_t sample_shift,
                            bool dual_flash)
{
   if (prescaler > 255U || fsize_log2 > 31U || cs_high_cyc > 7U ||
       sample_shift > 1U)
      return HAL_ERROR;

   __HAL_RCC_GPIOD_CLK_ENABLE();
   __HAL_RCC_GPIOE_CLK_ENABLE();
   __HAL_RCC_GPIOF_CLK_ENABLE();
   __HAL_RCC_GPIOH_CLK_ENABLE();

   release_board_qspi_conflicts();
   setup_qspi_io_timing();

   __HAL_RCC_QSPI_CLK_ENABLE();
   __HAL_RCC_QSPI_FORCE_RESET();
   __HAL_RCC_QSPI_RELEASE_RESET();
   setup_dlyb();

   setupgpio(QSPI_CLK_PORT, QSPI_CLK_PIN, QSPI_CLK_AF);
   setupgpio(QSPI_NCS_PORT, QSPI_NCS_PIN, QSPI_NCS_AF);
   setupgpio_data(QSPI_IO0_PORT, QSPI_IO0_PIN, QSPI_IO0_AF);
   setupgpio_data(QSPI_IO1_PORT, QSPI_IO1_PIN, QSPI_IO1_AF);
   setupgpio_data(QSPI_IO2_PORT, QSPI_IO2_PIN, QSPI_IO2_AF);
   setupgpio_data(QSPI_IO3_PORT, QSPI_IO3_PIN, QSPI_IO3_AF);

   QUADSPI->CR &= ~QUADSPI_CR_EN;

   uint32_t cr = (prescaler & 0xFFU) << QUADSPI_CR_PRESCALER_Pos;
   if (sample_shift)
      cr |= QUADSPI_CR_SSHIFT;
   if (dual_flash)
      cr |= QUADSPI_CR_DFM;
   cr |= (cur_fthres << QUADSPI_CR_FTHRES_Pos);
   QUADSPI->CR = cr;

   QUADSPI->DCR = ((fsize_log2 & 0x1FU) << QUADSPI_DCR_FSIZE_Pos) |
                  ((cs_high_cyc & 0x07U) << QUADSPI_DCR_CSHT_Pos);

   QUADSPI->FCR = QUADSPI_FCR_CTOF | QUADSPI_FCR_CSMF | QUADSPI_FCR_CTCF |
                  QUADSPI_FCR_CTEF;
   QUADSPI->CR |= QUADSPI_CR_EN;

   cur_prescaler = prescaler;
   cur_fsize     = fsize_log2;
   cur_csht      = cs_high_cyc;
   initialised   = 1;
   return HAL_OK;
}

static HAL_StatusTypeDef wait_not_busy(uint32_t deadline)
{
   while (QUADSPI->SR & QUADSPI_SR_BUSY) {
      if ((int32_t)(HAL_GetTick() - deadline) >= 0) {
         qspi_abort();
         return HAL_TIMEOUT;
      }
   }
   return HAL_OK;
}

static uint32_t build_ccr(const qspi_cmd_t *cmd, qspi_fmode_t fmode)
{
   uint32_t ccr = 0;
   ccr |= ((uint32_t)cmd->instruction & 0xFFU) << CCR_INSTRUCTION_Pos;
   ccr |= lines_to_mode(cmd->inst_lines) << CCR_IMODE_Pos;
   ccr |= lines_to_mode(cmd->addr_lines) << CCR_ADMODE_Pos;
   ccr |= lines_to_mode(cmd->alt_lines) << CCR_ABMODE_Pos;
   ccr |= lines_to_mode(cmd->data_lines) << CCR_DMODE_Pos;
   if (cmd->addr_lines != QSPI_LINES_NONE && cmd->addr_bytes)
      ccr |= (uint32_t)(cmd->addr_bytes - 1U) << CCR_ADSIZE_Pos;
   if (cmd->alt_lines != QSPI_LINES_NONE && cmd->alt_bytes_len)
      ccr |= (uint32_t)(cmd->alt_bytes_len - 1U) << CCR_ABSIZE_Pos;
   ccr |= (uint32_t)(cmd->dummy_cycles & 0x1FU) << CCR_DCYC_Pos;
   ccr |= ((uint32_t)fmode & 0x3U) << CCR_FMODE_Pos;
   if (cmd->ddr)
      ccr |= QUADSPI_CCR_DDRM;
   return ccr;
}

static HAL_StatusTypeDef poll_flag(uint32_t mask, uint32_t deadline)
{
   for (;;) {
      const uint32_t sr = QUADSPI->SR;
      if (sr & mask)
         return HAL_OK;
      if (sr & QUADSPI_SR_TEF) {
         qspi_abort();
         return HAL_ERROR;
      }
      if ((int32_t)(HAL_GetTick() - deadline) >= 0) {
         qspi_abort();
         return HAL_TIMEOUT;
      }
   }
}

static HAL_StatusTypeDef wait_read_data(uint32_t mask, uint32_t deadline)
{
   for (;;) {
      const uint32_t sr = QUADSPI->SR;
      if (sr & mask)
         return HAL_OK;
      if (sr & QUADSPI_SR_TEF) {
         qspi_abort();
         return HAL_ERROR;
      }
      if ((int32_t)(HAL_GetTick() - deadline) >= 0) {
         qspi_abort();
         return HAL_TIMEOUT;
      }
   }
}

static HAL_StatusTypeDef read_dr_byte(uint32_t deadline, uint8_t *byte_out,
                                      uint32_t *wait_iters)
{
   for (;;) {
      const uint32_t sr = QUADSPI->SR;
      if (sr & QUADSPI_SR_FLEVEL) {
         *byte_out = *(volatile uint8_t *)&QUADSPI->DR;
         return HAL_OK;
      }
      if (wait_iters != NULL)
         (*wait_iters)++;
      if (sr & QUADSPI_SR_TEF) {
         qspi_abort();
         return HAL_ERROR;
      }
      if ((int32_t)(HAL_GetTick() - deadline) >= 0) {
         qspi_abort();
         return HAL_TIMEOUT;
      }
   }
}

HAL_StatusTypeDef qspi_xfer(const qspi_cmd_t *cmd, qspi_fmode_t fmode,
                            void *buf, uint32_t timeout_ms)
{
   if (!initialised || cmd == NULL)
      return HAL_ERROR;
   if (cmd->data_len && buf == NULL && fmode != QSPI_FMODE_AUTOPOLL)
      return HAL_ERROR;
   if (cmd->addr_bytes > 4U || cmd->alt_bytes_len > 4U ||
       cmd->dummy_cycles > 31U)
      return HAL_ERROR;

   const uint32_t deadline = HAL_GetTick() + timeout_ms;

   HAL_StatusTypeDef s = wait_not_busy(deadline);
   if (s != HAL_OK)
      return s;

   QUADSPI->FCR = QUADSPI_FCR_CTOF | QUADSPI_FCR_CSMF | QUADSPI_FCR_CTCF |
                  QUADSPI_FCR_CTEF;
   QUADSPI->DLR = cmd->data_len ? (cmd->data_len - 1U) : 0U;
   QUADSPI->ABR = cmd->alt_bytes;
   QUADSPI->CCR = build_ccr(cmd, fmode);
   if (cmd->addr_lines != QSPI_LINES_NONE)
      QUADSPI->AR = cmd->address;

   uint8_t qdr_bytes[16];
   uint32_t qdr_count = 0U;
   if (cmd->data_len) {
      volatile uint8_t  *const dr8  = (volatile uint8_t  *)&QUADSPI->DR;
      volatile uint32_t *const dr32 = (volatile uint32_t *)&QUADSPI->DR;
      uint8_t *bp                   = (uint8_t *)buf;
      uint32_t remaining            = cmd->data_len;
      const bool qdr_diag =
         (fmode == QSPI_FMODE_READ && cmd->data_lines == QSPI_LINES_4 &&
          (cmd->instruction == 0x6BU || cmd->instruction == 0x6DU));
      if (fmode == QSPI_FMODE_READ && cmd->data_lines == QSPI_LINES_4) {
         while (remaining) {
            uint8_t b;
            s = read_dr_byte(deadline, &b, NULL);
            if (s != HAL_OK)
               return s;
            *bp++ = b;
            if (qdr_diag && qdr_count < sizeof(qdr_bytes))
               qdr_bytes[qdr_count++] = b;
            remaining--;
         }
      } else if (fmode == QSPI_FMODE_READ) {
         while (remaining >= 4U) {
            s = wait_read_data(QUADSPI_SR_FTF | QUADSPI_SR_TCF, deadline);
            if (s != HAL_OK)
               return s;
            const uint32_t w = *dr32;
            bp[0] = (uint8_t)(w >> 0);
            bp[1] = (uint8_t)(w >> 8);
            bp[2] = (uint8_t)(w >> 16);
            bp[3] = (uint8_t)(w >> 24);
            if (qdr_diag) {
               for (uint32_t i = 0; i < 4U && qdr_count < sizeof(qdr_bytes);
                    i++)
                  qdr_bytes[qdr_count++] = bp[i];
            }
            bp += 4;
            remaining -= 4U;
         }
         if (remaining) {
            s = wait_read_data(QUADSPI_SR_TCF, deadline);
            if (s != HAL_OK)
               return s;
            const uint32_t w = *dr32;
            for (uint32_t i = 0; i < remaining; i++) {
               bp[i] = (uint8_t)(w >> (8U * i));
               if (qdr_diag && qdr_count < sizeof(qdr_bytes))
                  qdr_bytes[qdr_count++] = bp[i];
            }
            remaining = 0U;
         }
      } else {
         while (remaining) {
            s = poll_flag(QUADSPI_SR_FTF, deadline);
            if (s != HAL_OK)
               return s;
            *dr8 = *bp++;
            remaining--;
         }
      }
   }

   s = poll_flag(QUADSPI_SR_TCF, deadline);
   if (s != HAL_OK)
      return s;
   QUADSPI->FCR = QUADSPI_FCR_CTCF;

   s = wait_not_busy(deadline);
   if (s != HAL_OK)
      return s;

   if (qdr_count) {
      my_printf("qdr%02x", (unsigned)cmd->instruction);
      for (uint32_t i = 0; i < qdr_count; i++)
         my_printf(" %02x", (unsigned)qdr_bytes[i]);
      my_printf("\r\n");
   }

   return HAL_OK;
}

HAL_StatusTypeDef qspi_mm_enable(const qspi_cmd_t *cmd)
{
   if (!initialised || cmd == NULL)
      return HAL_ERROR;

   const uint32_t deadline = HAL_GetTick() + 100U;
   HAL_StatusTypeDef s     = wait_not_busy(deadline);
   if (s != HAL_OK)
      return s;

   QUADSPI->FCR = QUADSPI_FCR_CTOF | QUADSPI_FCR_CSMF | QUADSPI_FCR_CTCF |
                  QUADSPI_FCR_CTEF;
   QUADSPI->ABR = cmd->alt_bytes;
   /* Keep every memory-mapped microframe self-contained.  The AHB bridge can
    * split one logical stream into multiple short CS-low transactions; SIOO
    * would omit the instruction phase after the first one, shortening later
    * frames by 8 SCLKs and desynchronizing simple FPGA stream responders. */
   QUADSPI->CCR = build_ccr(cmd, QSPI_FMODE_MEMMAPPED);
   return HAL_OK;
}

void qspi_mm_disable(void)
{
   /* qspi_abort() is unconditional and resets FIFO + deasserts CS,
    * which is what mem-mapped tear-down also needs. */
   qspi_abort();
}

