js216/stm32mp135_test_board/baremetal/qspi/src/qspi.c
   const bool quad_raw = raw && data_lines == QSPI_LINES_4;

   uint32_t cr = QUADSPI->CR;
   cr &= ~QUADSPI_CR_FTHRES_Msk;
   /* Word-aligned FTHRES=3 (4-byte threshold) for the 32-bit MDMA
    * SSIZE=2 reads.  Earlier the raw_quad path used FTHRES=15 which
    * caused nibble loss at the FIFO byte-boundary (FIFO entries are
    * 32-bit; byte/word access width mismatch retires fewer bytes per
    * pop than the FIFO holds).  FTHRES=3 keeps the trigger threshold
    * matched to the MDMA beat width and avoids the misalignment. */
   cr |= ((data_lines == QSPI_LINES_4 ? 3U : cur_fthres)
          << QUADSPI_CR_FTHRES_Pos);
   QUADSPI->CR = cr;

   MDMA_Channel_TypeDef *const ch = MDMA_Channel0;

   /* Disable channel and clear any pending flags. */
   ch->CCR = 0U;
   ch->CIFCR = MDMA_CIFCR_CTEIF | MDMA_CIFCR_CCTCIF | MDMA_CIFCR_CBRTIF |
               MDMA_CIFCR_CBTIF | MDMA_CIFCR_CLTCIF;

   /* Clean+invalidate the destination cache range when requested so:
    *  (a) any dirty lines won't get written back over MDMA data, and
    *  (b) a subsequent CPU read picks up the fresh DDR contents.
    * The Cortex-A7 minimum L1 D-line is 32 B; loop is conservative. */
   const uint32_t line_sz = 32U;
   if (clean_before) {
      for (uint32_t a = dst_addr & ~(line_sz - 1U);
           a < dst_addr + len; a += line_sz)
         L1C_CleanInvalidateDCacheMVA((void *)a);
      __asm volatile("dsb sy" ::: "memory");
   }

   /* Number of bytes per buffer transfer. Normal reads use 64 B = 16 beats
    * of 32-bit (matches AXI/AHB max burst length on this CPU bus). Raw quad
    * uses byte reads packed into 32-bit DDR writes; the software request is
    * delayed until the first FIFO-ready indication so the initial MDMA reads
    * cannot race ahead of the QSPI data phase. */
#ifndef MDMA_TLEN
#define MDMA_TLEN 64U
#endif
#ifndef MDMA_SBURST
#define MDMA_SBURST 0U
#endif
   const uint32_t tlen = quad_raw ? 64U : MDMA_TLEN;
   const uint32_t bndt = len; /* block size in bytes */

   /* Block-repeat path requires 64 KiB-multiple lengths for >0x1FFFF.
    * Validate up front (matches the mem-mapped helper's check). */
   if (len > 0x1FFFFU && (len & 0xFFFFU))
      return HAL_ERROR;

   /* TRGM picks per-request granularity:
    *   small (<=TLEN)        -> 0 (one buffer per request)
    *   medium (<=64 KiB)     -> 1 (one block per request)
    *   large (block-repeat)  -> 2 (one repeated block == entire xfer)
    * One software trigger drains the whole transfer. */
   uint32_t trgm;
   if (len <= tlen) {
      trgm = 0U;
   } else if (len <= 65536U) {
      trgm = 1U;
   } else {
      trgm = 2U;
   }

   /* CTCR:
    *   SINC = 0  (source address fixed, QUADSPI->DR)
    *   DINC = 2  (destination increments)
    *   SSIZE = 0 for raw quad, 2 otherwise
    *   DSIZE = 2
    *   DINCOS = 2
    *   SBURST = 0 (single source read)
    *   DBURST = 0 for raw quad, 4 otherwise
    *   TLEN  = tlen-1
    *   PKE = 1 for raw quad, 0 otherwise
    *   TRGM = trgm
    *   SWRM = 1
    *   BWM  = 1
    */
   /* Use 32-bit source reads of QSPI->DR for ALL paths.  Previous
    * raw_quad used SSIZE=0 (byte) with PKE=1 (packing), which exposed
    * a byte-boundary alignment issue inside QSPI->DR when the FIFO
    * threshold trigger fired (corrupted last ~5 bytes of each 16-byte
    * chunk).  Word-mode reads pop 4 bytes per access atomically and
    * avoid that hazard. */
   const uint32_t ctcr =
       (0U  << MDMA_CTCR_SINC_Pos)   |
       (2U  << MDMA_CTCR_DINC_Pos)   |
       (2U  << MDMA_CTCR_SSIZE_Pos)  |
       (2U  << MDMA_CTCR_DSIZE_Pos)  |
       (2U  << MDMA_CTCR_DINCOS_Pos) |
       (MDMA_SBURST << MDMA_CTCR_SBURST_Pos) |
       (4U  << MDMA_CTCR_DBURST_Pos) |
       ((tlen - 1U) << MDMA_CTCR_TLEN_Pos) |
       (trgm << MDMA_CTCR_TRGM_Pos) |
       MDMA_CTCR_SWRM |
       MDMA_CTCR_BWM;

   /* CBNDTR.BNDT = block size in bytes (max 0x1FFFF = 128 KB - 1).
    * For multi-MB transfers, use block-repeat with 65536-byte blocks.
    * Source is fixed (QUADSPI->DR) so BRSUM=0; destination is contiguous
    * across blocks so BRDUM=1.  CBRUR stays 0 (no per-block address
    * offset). */
   if (len > 0x1FFFFU) {
      const uint32_t blocks = len >> 16; /* len / 65536 */
      if (blocks == 0U || blocks > 0xFFFU + 1U)
         return HAL_ERROR;
      ch->CBNDTR = (65536U & MDMA_CBNDTR_BNDT_Msk) |
                   ((blocks - 1U) << MDMA_CBNDTR_BRC_Pos) |
                   MDMA_CBNDTR_BRDUM; /* dst increments across blocks */
      ch->CBRUR = 0U;
   } else {
      ch->CBNDTR = bndt & MDMA_CBNDTR_BNDT_Msk;
      ch->CBRUR  = 0U;
   }

   ch->CTCR = ctcr;
   ch->CSAR = (uint32_t)&QUADSPI->DR;
   ch->CDAR = dst_addr;
   /* CTBR.TSEL = 0x1A (QUADSPI FIFO threshold). SWRM paths ignore it.
    * SBUS/DBUS = 0. */
   ch->CTBR = 0x1AU & MDMA_CTBR_TSEL_Msk;
   ch->CMAR = 0U;
   ch->CMDR = 0U;

   /* Build QUADSPI CCR (FMODE=01 indirect read).  Match the bench's
    * raw / non-raw layout. */
   QUADSPI->DLR = len - 1U;
   QUADSPI->ABR = 0U;

   uint32_t ccr = 0;
   const bool framed_raw = raw_quad_uses_frame(raw, data_lines);
   if (!raw || framed_raw) {
      ccr |= ((uint32_t)opcode) << CCR_INSTRUCTION_Pos;
      ccr |= 1U << CCR_IMODE_Pos;
      ccr |= 1U << CCR_ADMODE_Pos;
      ccr |= (3U - 1U) << CCR_ADSIZE_Pos;
   }
   ccr |= lines_to_mode(data_lines) << CCR_DMODE_Pos;
   ccr |= (uint32_t)(dummy_cycles & 0x1FU) << CCR_DCYC_Pos;
   ccr |= ((uint32_t)QSPI_FMODE_READ) << CCR_FMODE_Pos;

   QUADSPI->CR |= QUADSPI_CR_DMAEN;
   __asm volatile("dsb sy" ::: "memory");
   ch->CCR = MDMA_CCR_EN | MDMA_CCR_PL;
   __asm volatile("dsb sy" ::: "memory");

   QUADSPI->CCR = ccr;
   if (!raw || framed_raw)
      QUADSPI->AR = 0U;

   if (quad_raw) {
      HAL_StatusTypeDef s = poll_flag(QUADSPI_SR_FTF | QUADSPI_SR_TCF,
                                      deadline);
      if (s != HAL_OK) {
         ch->CCR = 0U;
         QUADSPI->CR &= ~QUADSPI_CR_DMAEN;
         qspi_abort();
         ch->CIFCR = MDMA_CIFCR_CTEIF | MDMA_CIFCR_CCTCIF |
                     MDMA_CIFCR_CBRTIF | MDMA_CIFCR_CBTIF |
                     MDMA_CIFCR_CLTCIF;
         return s;
      }
   }
   /* Issue the software request: the channel pulls beats back-to-back,
    * AHB-stalled when the QSPI FIFO is empty. */
   ch->CCR = MDMA_CCR_EN | MDMA_CCR_PL | MDMA_CCR_SWRQ;
   qspi_log_raw_regs("mdma", len, raw, data_lines, framed_raw);

   mdma_active_dst = dst_addr;
   mdma_active_len = len;
   mdma_active = true;
   return HAL_OK;
}

HAL_StatusTypeDef qspi_mdma_crc_start(uint8_t opcode,
                                      qspi_lines_t data_lines,
                                      uint8_t dummy_cycles,
                                      uint32_t len,
                                      bool raw,
                                      uint32_t crc_dr_addr,
                                      uint32_t timeout_ms)
{
   if (!initialised || len == 0U)
      return HAL_ERROR;
   if (mdma_active)
      return HAL_BUSY;
   const bool quad_raw = raw && data_lines == QSPI_LINES_4;

