js216/stm32mp135_test_board/baremetal/qspi/src/qspi.c
   __HAL_RCC_MDMA_CLK_ENABLE();

   const uint32_t deadline = HAL_GetTick() + timeout_ms;
   while (QUADSPI->SR & QUADSPI_SR_BUSY) {
      if ((int32_t)(HAL_GetTick() - deadline) >= 0) {
         qspi_abort();
         return HAL_TIMEOUT;
      }
   }
   QUADSPI->FCR = QUADSPI_FCR_CTOF | QUADSPI_FCR_CSMF | QUADSPI_FCR_CTCF |
                  QUADSPI_FCR_CTEF;
   qspi_raw_frame_reset_gap(raw);

   uint32_t cr = QUADSPI->CR;
   cr &= ~QUADSPI_CR_FTHRES_Msk;
   cr |= ((quad_raw ? 15U : (data_lines == QSPI_LINES_4 ? 3U : 15U))
          << QUADSPI_CR_FTHRES_Pos);
   QUADSPI->CR = cr;

   MDMA_Channel_TypeDef *const ch = MDMA_Channel0;
   ch->CCR = 0U;
   ch->CIFCR = MDMA_CIFCR_CTEIF | MDMA_CIFCR_CCTCIF | MDMA_CIFCR_CBRTIF |
               MDMA_CIFCR_CBTIF | MDMA_CIFCR_CLTCIF;

   /* Normal streams use 32-bit reads from QSPI->DR feeding 32-bit writes
    * to CRC1->DR. Raw quad must keep the QSPI side byte-sized: 32-bit
    * indirect-read DR accesses return stale upper byte lanes on MP135.
    * MDMA pack mode groups four valid DR byte reads into one CRC word
    * write, preserving the byte stream while avoiding a byte write per
    * source byte. */
   if (len & 0x3U)
      return HAL_ERROR;

#ifndef MDMA_TLEN_CRC
#define MDMA_TLEN_CRC 64U
#endif
   const uint32_t tlen = quad_raw ? 16U : MDMA_TLEN_CRC;

   if (len > 0x1FFFFU && (len & 0xFFFFU))
      return HAL_ERROR;

   uint32_t trgm;
   if (len <= tlen)
      trgm = 0U;
   else if (len <= 65536U)
      trgm = 1U;
   else
      trgm = 2U;

   /* For raw quad, SSIZE=0 + DSIZE=2 + PKE packs four QSPI DR byte
    * reads into one little-endian word write to CRC1->DR. For non-raw
    * streams, SSIZE=DSIZE=2 keeps the existing word-wide path. CRC is
    * configured with REV_IN=11 by crc32_hw_begin_direct(), matching the
    * packed little-endian word feed. */
   const uint32_t ctcr =
       (0U  << MDMA_CTCR_SINC_Pos)   |
       (0U  << MDMA_CTCR_DINC_Pos)   |
       ((quad_raw ? 0U : 2U) << MDMA_CTCR_SSIZE_Pos) |
       (2U  << MDMA_CTCR_DSIZE_Pos)  |
       (0U  << MDMA_CTCR_SINCOS_Pos) |
       (0U  << MDMA_CTCR_DINCOS_Pos) |
       (0U  << MDMA_CTCR_SBURST_Pos) |
       (0U  << MDMA_CTCR_DBURST_Pos) |
       ((tlen - 1U) << MDMA_CTCR_TLEN_Pos) |
       (quad_raw ? MDMA_CTCR_PKE : 0U) |
       ((quad_raw ? 0U : trgm) << MDMA_CTCR_TRGM_Pos) |
       (quad_raw ? 0U : MDMA_CTCR_SWRM) |
       MDMA_CTCR_BWM;

   if (len > 0x1FFFFU) {
      const uint32_t blocks = len >> 16;
      if (blocks == 0U || blocks > 0xFFFU + 1U)
         return HAL_ERROR;
      ch->CBNDTR = (65536U & MDMA_CBNDTR_BNDT_Msk) |
                   ((blocks - 1U) << MDMA_CBNDTR_BRC_Pos);
   } else {
      ch->CBNDTR = len & MDMA_CBNDTR_BNDT_Msk;
   }
   ch->CBRUR = 0U;
   ch->CTCR  = ctcr;
   ch->CSAR  = (uint32_t)&QUADSPI->DR;
   ch->CDAR  = crc_dr_addr;
   ch->CTBR  = 0x1AU & MDMA_CTBR_TSEL_Msk;
   ch->CMAR  = 0U;
   ch->CMDR  = 0U;

   QUADSPI->DLR = len - 1U;
   QUADSPI->ABR = 0U;

   uint32_t ccr = 0;
   const bool framed_raw = raw_quad_uses_frame(raw, data_lines);
   if (!raw || framed_raw) {
      ccr |= ((uint32_t)opcode) << CCR_INSTRUCTION_Pos;
      ccr |= 1U << CCR_IMODE_Pos;
      ccr |= 1U << CCR_ADMODE_Pos;
      ccr |= (3U - 1U) << CCR_ADSIZE_Pos;
   }
   ccr |= lines_to_mode(data_lines) << CCR_DMODE_Pos;
   ccr |= (uint32_t)(dummy_cycles & 0x1FU) << CCR_DCYC_Pos;
   ccr |= ((uint32_t)QSPI_FMODE_READ) << CCR_FMODE_Pos;

   QUADSPI->CR |= QUADSPI_CR_DMAEN;

   /* Arm channel (without SWRQ) before kicking QSPI. */
   __asm volatile("dsb sy" ::: "memory");
   ch->CCR = MDMA_CCR_EN | MDMA_CCR_PL;
   __asm volatile("dsb sy" ::: "memory");

   QUADSPI->CCR = ccr;
   if (!raw || framed_raw)
      QUADSPI->AR = 0U;
   qspi_log_raw_regs("mdma_crc", len, raw, data_lines, framed_raw);

   if (!quad_raw) {
      /* Software request; channel drains block back-to-back, AHB-stalled
       * when the QSPI FIFO is empty. */
      ch->CCR = MDMA_CCR_EN | MDMA_CCR_PL | MDMA_CCR_SWRQ;
   }

   mdma_active_dst = 0U;
   mdma_active_len = 0U;
   mdma_active = true;
   return HAL_OK;
}

HAL_StatusTypeDef qspi_mdma_crc_read(uint8_t opcode,
                                     qspi_lines_t data_lines,
                                     uint8_t dummy_cycles,
                                     uint32_t len,
                                     bool raw,
                                     uint32_t crc_dr_addr,
                                     uint32_t timeout_ms)
{
   HAL_StatusTypeDef s = qspi_mdma_crc_start(opcode, data_lines,
                                             dummy_cycles, len, raw,
                                             crc_dr_addr, timeout_ms);
   if (s != HAL_OK)
      return s;
   return qspi_mdma_finish_no_inval(timeout_ms);
}

HAL_StatusTypeDef qspi_mdma_finish_no_inval(uint32_t timeout_ms)
{
   if (!mdma_active)
      return HAL_ERROR;

   MDMA_Channel_TypeDef *const ch = MDMA_Channel0;
   const uint32_t deadline = HAL_GetTick() + timeout_ms;

   /* Wait for MDMA channel transfer complete. Once CTCIF fires, all data
    * MDMA was programmed for is in DDR. We don't care about QSPI's TCF
    * because we'll abort QSPI right after. */
   while (!(ch->CISR & MDMA_CISR_CTCIF)) {
      if ((int32_t)(HAL_GetTick() - deadline) >= 0) {
         my_printf("ERR mdma_finish timeout cisr=%08lx cesr=%08lx "
                   "cbndtr=%08lx qsr=%08lx qcr=%08lx qccr=%08lx "
                   "dlyb_cr=%08lx dlyb_cfgr=%08lx\r\n",
                   (unsigned long)ch->CISR,
                   (unsigned long)ch->CESR,
                   (unsigned long)ch->CBNDTR,
                   (unsigned long)QUADSPI->SR,
                   (unsigned long)QUADSPI->CR,
                   (unsigned long)QUADSPI->CCR,
                   (unsigned long)DLYB_QUADSPI->CR,
                   (unsigned long)DLYB_QUADSPI->CFGR);
         ch->CCR = 0U;
         QUADSPI->CR &= ~QUADSPI_CR_DMAEN;
         qspi_abort();
         mdma_active = false;
         return HAL_TIMEOUT;
      }
   }

   /* Tear down. Abort QSPI to stop any further clocking. */
   ch->CCR = 0U;
   QUADSPI->CR &= ~QUADSPI_CR_DMAEN;
   qspi_abort();
   ch->CIFCR = MDMA_CIFCR_CTEIF | MDMA_CIFCR_CCTCIF | MDMA_CIFCR_CBRTIF |
               MDMA_CIFCR_CBTIF | MDMA_CIFCR_CLTCIF;
   mdma_active = false;
   return HAL_OK;
}

void qspi_invalidate_range(uint32_t addr, uint32_t len)
{
   const uint32_t line_sz = 32U;
   for (uint32_t a = addr & ~(line_sz - 1U); a < addr + len; a += line_sz)
      L1C_InvalidateDCacheMVA((void *)a);
   __asm volatile("dsb sy" ::: "memory");
}

