js216/stm32mp135_test_board/baremetal/qspi/src/qspi.c
HAL_StatusTypeDef qspi_mdma_finish(uint32_t timeout_ms)
{
   const uint32_t dst = mdma_active_dst;
   const uint32_t len = mdma_active_len;
   HAL_StatusTypeDef s = qspi_mdma_finish_no_inval(timeout_ms);
   if (s == HAL_OK)
      qspi_invalidate_range(dst, len);
   return s;
}

HAL_StatusTypeDef qspi_mdma_read(uint8_t opcode, qspi_lines_t data_lines,
                                 uint8_t dummy_cycles, uint32_t len,
                                 bool raw, uint32_t dst_addr,
                                 uint32_t timeout_ms, bool clean_before)
{
   HAL_StatusTypeDef s = qspi_mdma_start(opcode, data_lines, dummy_cycles,
                                         len, raw, dst_addr, timeout_ms,
                                         clean_before);
   if (s != HAL_OK)
      return s;
   return qspi_mdma_finish(timeout_ms);
}

/* Variant of qspi_mdma_start that programs QUADSPI->AR with `flash_addr`
 * so chunked-read stitching can issue each chunk at its own slave
 * address. This duplicates qspi_mdma_start (instead of refactoring) so
 * the working baseline path stays bit-identical. */
static HAL_StatusTypeDef qspi_mdma_start_addr(uint8_t opcode,
                                              qspi_lines_t data_lines,
                                              uint8_t dummy_cycles,
                                              uint32_t len, bool raw,
                                              uint32_t flash_addr,
                                              uint32_t dst_addr,
                                              uint32_t timeout_ms,
                                              bool clean_before)
{
   if (!initialised || len == 0U)
      return HAL_ERROR;
   if (dst_addr & 0x3U)
      return HAL_ERROR;
   if (mdma_active)
      return HAL_BUSY;

   __HAL_RCC_MDMA_CLK_ENABLE();

   const uint32_t deadline = HAL_GetTick() + timeout_ms;

   while (QUADSPI->SR & QUADSPI_SR_BUSY) {
      if ((int32_t)(HAL_GetTick() - deadline) >= 0) {
         qspi_abort();
         return HAL_TIMEOUT;
      }
   }
   QUADSPI->FCR = QUADSPI_FCR_CTOF | QUADSPI_FCR_CSMF | QUADSPI_FCR_CTCF |
                  QUADSPI_FCR_CTEF;
   qspi_raw_frame_reset_gap(raw);
   const bool quad_byte_dr = (data_lines == QSPI_LINES_4);

   uint32_t cr = QUADSPI->CR;
   cr &= ~QUADSPI_CR_FTHRES_Msk;
   cr |= (15U << QUADSPI_CR_FTHRES_Pos);
   QUADSPI->CR = cr;

   MDMA_Channel_TypeDef *const ch = MDMA_Channel0;
   ch->CCR = 0U;
   ch->CIFCR = MDMA_CIFCR_CTEIF | MDMA_CIFCR_CCTCIF | MDMA_CIFCR_CBRTIF |
               MDMA_CIFCR_CBTIF | MDMA_CIFCR_CLTCIF;

   const uint32_t line_sz = 32U;
   if (clean_before) {
      for (uint32_t a = dst_addr & ~(line_sz - 1U);
           a < dst_addr + len; a += line_sz)
         L1C_CleanInvalidateDCacheMVA((void *)a);
      __asm volatile("dsb sy" ::: "memory");
   }

   /* This helper is QSPI FTF-request paced (SWRM is clear).  With
    * FTHRES programmed for 16 bytes, one hardware request must consume
    * no more than those guaranteed FIFO bytes.  Quad also keeps source
    * and destination byte-sized; 32-bit DR reads expose stale upper byte
    * lanes. */
   const uint32_t tlen = (len < 16U) ? len : 16U;
   const uint32_t bndt = len;

   const uint32_t ctcr =
       (0U  << MDMA_CTCR_SINC_Pos)   |
       (2U  << MDMA_CTCR_DINC_Pos)   |
       ((quad_byte_dr ? 0U : 2U) << MDMA_CTCR_SSIZE_Pos) |
       ((quad_byte_dr ? 0U : 2U) << MDMA_CTCR_DSIZE_Pos) |
       ((quad_byte_dr ? 0U : 2U) << MDMA_CTCR_DINCOS_Pos) |
       (0U  << MDMA_CTCR_SBURST_Pos) |
       (0U  << MDMA_CTCR_DBURST_Pos) |
       ((tlen - 1U) << MDMA_CTCR_TLEN_Pos) |
       MDMA_CTCR_BWM;

   if (len > 0x1FFFFU) {
      if (len & 0xFFFFU)
         return HAL_ERROR;
      const uint32_t blocks = len >> 16;
      if (blocks == 0U || blocks > 0xFFFU + 1U)
         return HAL_ERROR;
      ch->CBNDTR = (65536U & MDMA_CBNDTR_BNDT_Msk) |
                   ((blocks - 1U) << MDMA_CBNDTR_BRC_Pos) |
                   MDMA_CBNDTR_BRDUM;
      ch->CBRUR = 0U;
   } else {
      ch->CBNDTR = bndt & MDMA_CBNDTR_BNDT_Msk;
      ch->CBRUR  = 0U;
   }

   ch->CTCR = ctcr;
   ch->CSAR = (uint32_t)&QUADSPI->DR;
   ch->CDAR = dst_addr;
   ch->CTBR = 0x1AU & MDMA_CTBR_TSEL_Msk;
   ch->CMAR = 0U;
   ch->CMDR = 0U;

   QUADSPI->DLR = len - 1U;
   QUADSPI->ABR = 0U;

   uint32_t ccr = 0;
   const bool framed_raw = raw_quad_uses_frame(raw, data_lines);
   if (!raw || framed_raw) {
      ccr |= ((uint32_t)opcode) << CCR_INSTRUCTION_Pos;
      ccr |= 1U << CCR_IMODE_Pos;
      ccr |= 1U << CCR_ADMODE_Pos;
      ccr |= (3U - 1U) << CCR_ADSIZE_Pos;
   }
   ccr |= lines_to_mode(data_lines) << CCR_DMODE_Pos;
   ccr |= (uint32_t)(dummy_cycles & 0x1FU) << CCR_DCYC_Pos;
   ccr |= ((uint32_t)QSPI_FMODE_READ) << CCR_FMODE_Pos;

   QUADSPI->CR |= QUADSPI_CR_DMAEN;
   ch->CCR = MDMA_CCR_EN | MDMA_CCR_PL;

   QUADSPI->CCR = ccr;
   if (!raw || framed_raw)
      QUADSPI->AR = flash_addr;
   qspi_log_raw_regs("mdma_addr", len, raw, data_lines, framed_raw);

   mdma_active_dst = dst_addr;
   mdma_active_len = len;
   mdma_active = true;
   return HAL_OK;
}

HAL_StatusTypeDef qspi_mdma_read_addr(uint8_t opcode, qspi_lines_t data_lines,
                                      uint8_t dummy_cycles, uint32_t len,
                                      bool raw, uint32_t flash_addr,
                                      uint32_t dst_addr,
                                      uint32_t timeout_ms, bool clean_before)
{
   HAL_StatusTypeDef s = qspi_mdma_start_addr(opcode, data_lines,
                                              dummy_cycles, len, raw,
                                              flash_addr, dst_addr,
                                              timeout_ms, clean_before);
   if (s != HAL_OK)
      return s;
   return qspi_mdma_finish(timeout_ms);
}
